-- Задания на знания SQL
-- Существуют 2 таблицы в базе данных.
-- Book – справочник книг
-- Sales – таблица с продажами книг

-- Таблица Book включает следующие поля:


CREATE TABLE "Book" (
  "BookID" BIGINT NOT NULL, 
  "Author" VARCHAR(100) NOT NULL, 
  "Seria" VARCHAR(255) NULL, 
  "Title" VARCHAR(255) NULL,
  PRIMARY KEY("BookID")
);

-- Таблица Sales включает следующие поля:

CREATE TABLE "Sales" (
	FOREIGN KEY ("BookID") REFERENCES "Book" ("BookID"),
	"BookID" BIGINT NOT NULL,
	"Date" TIMESTAMP NOT NULL,
	"Qt"  INT NULL,
	"Qm"  NUMERIC(9,2) NULL
);

-- Таблицы Book и Sales связываются по полю BookID.

-- Добавим данные "Book" 
INSERT INTO "Book" (
  "BookID", "Author", "Seria", "Title"
) 
VALUES 
  (1, 'Иванов', 'Серия 1', 'Супер книга'), 
  (2, 'Петров', 'Петровская книга', 'Петров бук'),
  (3, 'Сидоров', 'Qweqwe', 'Qweqwe'),
  (4, 'Иванов', 'Серия 2', 'Серия 2'),
  (5, 'Сидоров', 'Qweqwe 2', 'Qweqwe 2'),
  (6, 'Зубастов', 'Гоблины', 'Гоблины'),
  (7, 'Смирнов', 'Садовов', 'Садовов'),
  (8, 'Путин', 'Власть', 'СВласть'),
  (9, 'Зеленский', 'Лидер', 'Лидер'),
  (10, 'Байден', 'Траволте', 'Траволте'),
  (11, 'Иванов1', 'Серия 1', 'Супер книга'), 
  (12, 'Петров1', 'Петровская книга', 'Петров бук'),
  (13, 'Сидоров1', 'Qweqwe', 'Qweqwe'),
  (14, 'Иванов1', 'Серия 2', 'Серия 2'),
  (15, 'Сидоров1', 'Qweqwe 2', 'Qweqwe 2'),
  (16, 'Зубастов1', 'Гоблины', 'Гоблины'),
  (17, 'Смирнов1', 'Садовов', 'Садовов'),
  (18, 'Путин1', 'Власть', 'СВласть'),
  (19, 'Зеленский1', 'Лидер', 'Лидер'),
  (20, 'Байден1', 'Траволте', 'Траволте'),
  (21, 'Иванов2', 'Серия 1', 'Супер книга'), 
  (22, 'Петров2', 'Петровская книга', 'Петров бук'),
  (23, 'Сидоров2', 'Qweqwe', 'Qweqwe'),
  (24, 'Иванов2', 'Серия 2', 'Серия 2'),
  (25, 'Сидоров2', 'Qweqwe 2', 'Qweqwe 2'),
  (26, 'Зубастов2', 'Гоблины', 'Гоблины'),
  (27, 'Смирнов2', 'Садовов', 'Садовов'),
  (28, 'Путин2', 'Власть', 'СВласть'),
  (29, 'Зеленский2', 'Лидер', 'Лидер'),
  (30, 'Байден2', 'Траволте', 'Траволте'); 
 
-- Добави данные "Sales" 
 INSERT INTO "Sales" (
  "BookID", "Date", "Qt", "Qm"
) 
VALUES 
  (1, '2022-01-22 19:10:25', 110, 20),
  (2, '2022-01-22 19:10:25', 210, 200),
  (3, '2022-02-22 19:10:25', 710, 200),
  (4, '2022-02-22 19:10:25', 10, 20),
  (5, '2022-02-22 19:10:25', 10, 212),
  (6, '2022-03-22 19:10:25', 710, 22120),
  (7, '2022-04-22 19:10:25', 10, 24540),
  (8, '2022-06-22 19:10:25', 910, 2450),
  (9, '2022-01-22 19:10:25', 810, 270),
  (10, '2022-06-22 19:10:25', 410, 27870),
  (1, '2022-01-22 19:10:25', 510, 2450),
  (2, '2021-06-22 19:10:25', 710, 120),
  (21, '2021-01-22 19:10:25', 910, 12120),
  (22, '2021-01-22 19:10:25', 310, 45720),
  (23, '2021-01-22 19:10:25', 810, 7820),
  (24, '2021-06-22 19:10:25', 10, 9820),
  (2, '2021-01-22 19:10:25', 10, 78920),
  (5, '2021-01-22 19:10:25', 710, 220),
  (6, '2021-01-22 19:10:25', 10, 45620),
  (8, '2021-06-22 19:10:25', 610, 787920),
  (9, '2021-06-22 19:10:25', 610, 8720),
  (15, '2021-06-22 19:10:25', 410, 78920),
  (15, '2021-06-22 19:10:25', 710, 54620),
  (28, '2021-08-22 19:10:25', 510, 45620),
  (28, '2021-07-22 19:10:25', 510, 212320),
  (29, '2021-08-22 19:10:25', 810, 45620),
  (30, '2021-08-22 19:10:25', 410, 24560),
  (12, '2021-06-22 19:10:25', 140, 45620),
  (1, '2021-10-22 19:10:25', 810, 45620),
  (3, '2021-11-22 19:10:25', 150, 45620);
 
-- DELETE FROM "Book"  WHERE "BookID"!=1;

-- 1.	Вывести список ТОП-10 авторов по продажам в 2021 году
SELECT 
  b."Author" as "Автор", 
  SUM(s."Qm") as "Суммарные продажи, руб" 
FROM 
  "Sales" s 
  JOIN "Book" b ON s."BookID" = b."BookID" 
WHERE 
  date_part('year', s."Date") = '2021' 
GROUP BY 
  b."Author" 
ORDER BY 
  2 DESC;
 
-- 2.	Вывести общий объём продаж книг, которые начали продаваться во втором полугодии 2021 года.
SELECT 
  SUM(s."Qt") as "Проданных книг, шт" 
FROM 
  "Sales" s 
  JOIN "Book" b ON s."BookID" = b."BookID" 
WHERE 
  s."Date" BETWEEN '2021-06-01' 
  AND '2021-12-31';
 
-- 3.	Вывести таблицу, в которой Посчитать количество книг (т.е. SKU), средняя цена которых упала / выросла в марте 2021 г. по сравнению с февралём

SELECT *
FROM 
 "Sales" s 
JOIN "Book" b ON s."BookID" =b."BookID" 
WHERE 
  s."Date" BETWEEN '2021-02-01' 
  AND '2021-02-28';

-- 4.	Допустим, в таблице Sales 1 млрд строк. Как бы вы настроили индексы, чтобы такие запросы выполнялись быстро? Почему именно так?




